[A_Creature_t5_base H7Creature]
mName="Учёный"
mLore="Учёные являются выдающимися чародеями с обширными познаниями в магии, алхимии, металлургии и минералогии. Их знания о чистой изначальной магии и её различных аспектах превосходят магов Серебряных городов. Путь к становлению учёным тернист и труден. Недаром среди них нет молодых людей."

[A_Creature_t5_upregate H7Creature]
mName="Маг-наставник"
mLore="Перед тем, как получить статус архимага, учёный становится магом-наставником. Он специализируется в одной области и доводит её до совершенства не только овладевая ею, но открывая или привнося что-то новое. В его задачу также входит обучение новых учёных. Маги-наставники являются верными служителями Асхи, и можно даже сказать, что они её жрецы."

[Ability.A_dome_Buff H7BaseBuff]
mName="Магический купол"
mTooltip="Существо получает на %res1 меньше урона от всех источников. Длительность (ходов): %durnow."

[Ability.A_dome_Buff_lv1 H7BaseBuff]
mName="Магический купол"
mTooltip="Существо получает на %res1 меньше урона от всех источников. Длительность (ходов): %durnow."

[Ability.A_dome_Buff_lv2 H7BaseBuff]
mName="Магический купол"
mTooltip="Существо получает на %res1 меньше урона от всех источников. Длительность (ходов): %durnow."

[Ability.A_dome_Buff_lv3 H7BaseBuff]
mName="Магический купол"
mTooltip="Существо получает на %res1 меньше урона от всех источников. Длительность (ходов): %durnow."

[Ability.A_Nova H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Лавина"
mTooltip="Наносит %d ед. урона от %ICON_Water магии воды всем врагам в очень большой области.\nМожно использовать один раз за бой."

[Ability.A_RangedAttack_Ice_Projectile H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Атака дальнего боя"
mTooltip="Атака дальнего боя"

[Ability.A_Resurrection H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Магический купол"
mTooltip="Все соседние дружественные существа получают защиту от всех источников урона в зависимости от их уровня Хладнокровия.\n(Нет ур.: %buff1.buff.res1)\n(Ур.1: %buff8.buff.res1)\n(Ур.2: %buff3.buff.res1)\n(Ур.3: %buff4.buff.res1)\nАура длится до конца текущего хода."

